app/Models/CommonModel.php

SELECT `users`.`id` as `user_id`, `users`.`name` as `user_name`, `users`.`accupation`, `users`.`age`, `users`.`address`, `users`.`nagar`, `users`.`phone_no`, `users`.`city`, `shikshan`.`id` as `shikshan_id`, `shikshan`.`name` as `shikshan_name`, `shikshan`.*, `daitva`.`id` as `daitva_id`, `daitva`.`name` as `daitva_name`, `daitva`.*, `vibhag`.`id` as `vibhag_id`, `vibhag`.`name` as `vibhag_name`, `vibhag`.*, `shaka_nagar`.`id` as `shaka_nagar_id`, `shaka_nagar`.`name` as `shaka_nagar_name`, `shaka_nagar`.*, `shaka`.`id` as `shaka_id`, `shaka`.`name` as `shaka_name`, `shaka`.*, `basti`.`id` as `basti_id`, `basti`.`name` as `basti_name`, `basti`.*
FROM `users`
LEFT JOIN `shaka` ON `shaka`.`id` = `users`.`shaka`
LEFT JOIN `basti` ON `basti`.`id` = `users`.`basti`
LEFT JOIN `shaka_nagar` ON `shaka_nagar`.`id` = `users`.`shaka_nagar`
LEFT JOIN `vibhag` ON `vibhag`.`id` = `users`.`vibhag`
LEFT JOIN `daitva` ON `daitva`.`id` = `users`.`daitva`
LEFT JOIN `shikshan` ON `shikshan`.`id` = `users`.`shikshan`
---
public function getUsersWithDetails($id = null)
{
    try {
        if ($id == null) {
            $builder = $this->db->table('users');
            $builder->select('users.id as user_id,users.name as user_name, users.accupation, users.age, users.address,users.nagar,users.phone_no,users.city ,shikshan.id as shikshan_id,shikshan.name as shikshan_name, shikshan.*,daitva.id as daitva_id,daitva.name as daitva_name, daitva.*, vibhag.id as vibhag_id,vibhag.name as vibhag_name, vibhag.*, shaka_nagar.id as shaka_nagar_id,shaka_nagar.name as shaka_nagar_name, shaka_nagar.*,shaka.id as shaka_id,shaka.name as shaka_name, shaka.*, basti.id as basti_id, basti.name as basti_name, basti.*');
            $builder->join('shaka', 'shaka.id = users.shaka', 'left');
            $builder->join('basti', 'basti.id = users.basti', 'left');
            $builder->join('shaka_nagar', 'shaka_nagar.id = users.shaka_nagar', 'left');
            $builder->join('vibhag', 'vibhag.id = users.vibhag', 'left');
            $builder->join('daitva', 'daitva.id = users.daitva', 'left');
            $builder->join('shikshan', 'shikshan.id = users.shikshan', 'left');
            $query = $builder->get();